[
  {
    "id": "invokos",
    "title": "InvoKos",
    "kicker": "Invoice Management System",
    "short_description": "Invoicing solution designed to streamline billing and financial management with ease.",
    "description": "Custom invoice management system I developed for personal use, supporting dual languages (English and Croatian). Built with Angular, Node.js, and Firebase, it streamlines invoicing and offer management with features like creating, updating, and deleting invoices/offers, customer management, and generating branded PDFs using jsPDF. While the app can and will be improved, I'm proud that it successfully fulfills its intended purpose. It is responsive, secure, and customizable for business needs.",
    "media": [
      {
        "fullPath": "assets/images/invokos/logo.png",
        "altText": "InvoKos logo"
      },
      {
        "fullPath": "assets/images/invokos/app.png",
        "altText": "InvoKos image"
      }
    ],
    "github_link": "https://github.com/kospaolo/invokos",
    "live_demo": ""
  },
  {
    "id": "constructor",
    "title": "Constructor (Concept)",
    "kicker": "Your Vision, Our Expertise",
    "short_description": "A concept for professional construction agency delivering precision and quality in every project.",
    "description": "This construction agency website is designed to stand out and leave a strong impression on business clients and project stakeholders. The bold yellow accents and clean typography give it a confident and professional feel, while the well-organized layout makes it easy to find key information. It’s tailored for professionals in real estate, renovations, and large-scale projects, showcasing the agency’s expertise and reliability.",
    "media": [
      {
        "fullPath": "assets/images/constructor/logo.png",
        "altText": "Constructor logo"
      },
      {
        "fullPath": "assets/images/constructor/app.png",
        "altText": "Constructor image"
      }
    ],
    "github_link": "",
    "live_demo": ""
  },
  {
    "id": "smile",
    "title": "Smile (Concept)",
    "kicker": "Bringing Confidence to Every Smile",
    "short_description": "A concept for a dental care service delivering personalized and accessible care.",
    "description": "Smile is a concept for a dental care website that feels approachable and easy to navigate. It’s designed for individuals and families looking for reliable dental care, with a focus on making services accessible and convenient. The calming blue tones and clean design help build trust, while the layout ensures a smooth and stress-free experience for users. This page highlights how modern design can make healthcare feel personal and welcoming.",
    "media": [
      {
        "fullPath": "assets/images/smile/logo.png",
        "altText": "Smile logo"
      },
      {
        "fullPath": "assets/images/smile/app.png",
        "altText": "Smile image"
      }
    ],
    "github_link": "",
    "live_demo": ""
  }
]
