[
  {
    "id": "wedding",
    "title": "Wedding App",
    "kicker": "Wedding Planner App",
    "short_description": "A wedding app for countdowns, schedules, digital invitations, guest seating, RSVP confirmations, photo uploads, and sharing memories with guests",
    "description": "The Wedding App helps couples and guests easily manage and access important wedding details. It features a countdown timer to the wedding day, a schedule overview, digital documents such as invitations, menus, and a seating chart with table search and a list of seatmates, RSVP confirmation for multiple guests with email notifications, photo uploads allowing guests to share images directly to Google Drive, and a gallery for viewing uploaded photos",
    "media": [
      {
        "fullPath": "assets/images/wedding/logo.png",
        "altText": "Wedding logo"
      },
      {
        "fullPath": "assets/images/wedding/app.png",
        "altText": "Wedding image"
      }
    ],
    "github_link": "",
    "live_demo": ""
  },
  {
    "id": "todo",
    "title": "ToDo App",
    "kicker": "Your Mind, Organized",
    "short_description": "A full-stack todo app with authentication, drag-and-drop, due dates, and profile management",
    "description": "ToDo App is a full-featured productivity app designed to help users manage tasks with ease and flexibility. It includes user registration and login, profile editing (username/password), due dates with overdue highlighting, drag-and-drop sorting, and filters for active, completed, today, or weekly tasks. The app is fully responsive and deployed on a scalable cloud stack using Angular, Node.js, MongoDB Atlas, Render, and Netlify.",
    "media": [
      {
        "fullPath": "assets/images/todo/logo.png",
        "altText": "ToDo logo"
      },
      {
        "fullPath": "assets/images/todo/app.png",
        "altText": "ToDo UI screenshot"
      }
    ],
    "github_link": "https://github.com/kospaolo/todo.git",
    "live_demo": "https://kostodo.netlify.app/"
  },
  {
    "id": "invokos",
    "title": "InvoKos",
    "kicker": "Invoice Management System",
    "short_description": "Invoicing solution designed to streamline billing and financial management with ease",
    "description": "Custom invoice management system I developed for personal use, supporting dual languages (English and Croatian). Built with Angular, Node.js, and Firebase, it streamlines invoicing and offer management with features like creating, updating, and deleting invoices/offers, customer management, and generating branded PDFs using jsPDF. While the app can and will be improved, I'm proud that it successfully fulfills its intended purpose. It is responsive, secure, and customizable for business needs.",
    "media": [
      {
        "fullPath": "assets/images/invokos/logo.png",
        "altText": "InvoKos logo"
      },
      {
        "fullPath": "assets/images/invokos/app.png",
        "altText": "InvoKos image"
      }
    ],
    "github_link": "https://github.com/kospaolo/invokos",
    "live_demo": ""
  },
  {
    "id": "rukazaruku",
    "title": "RukaZaRuku",
    "kicker": "Service Exchanging Platform",
    "short_description": "Community-driven platform that enables local communities to exchange services using in-app tokens",
    "description": "Our primary objective is to foster local community engagement by facilitating a token-based economy for exchanging services. Users can offer their skills or request services from others, creating a vibrant ecosystem of mutual support and skill-sharing. This project was developed during a 24-hour Hackathon by a team of 4 developers, and emerged as the winner of the competition!",
    "media": [
      {
        "fullPath": "assets/images/rukazaruku/logo.png",
        "altText": "InvoKos logo"
      },
      {
        "fullPath": "assets/images/rukazaruku/app.png",
        "altText": "RukaZaRuku image"
      }
    ],
    "github_link": "https://github.com/kospaolo/RukaZaRuku.git",
    "live_demo": ""
  },
  {
    "id": "cryptourists",
    "title": "CRYPTOurists",
    "kicker": "Decentralized booking platform",
    "short_description": "Enables businesses to list their services and accept cryptocurrency payments, while providing customers with a secure and transparent way to make booking",
    "description": "CRYPTOurists is a decentralized booking platform built on the Camino blockchain network. It enables businesses to list their services and accept cryptocurrency payments, while providing customers with a secure and transparent way to make bookings. All payments are securely held in the smart contract until the booking is either confirmed or refunded by the administrator. CRYPTOurists is a decentralized booking platform built on the Camino blockchain network. It enables businesses to list their services and accept cryptocurrency payments, while providing customers with a secure and transparent way to make bookings. All payments are securely held in the smart contract until the booking is either confirmed or refunded by the administrator. This project was created during the Decode Antalya Hackathon by a team of 5 developers with no prior blockchain knowledge, earning an impressive 2nd place finish.",
    "media": [
      {
        "fullPath": "assets/images/cryptourists/logo.png",
        "altText": "CRYPTOurists logo"
      },
      {
        "fullPath": "assets/images/cryptourists/app.jpg",
        "altText": "CRYPTOurists image"
      }
    ],
    "github_link": "https://github.com/kospaolo/CRYPTOurists",
    "live_demo": "https://cryptourists.vercel.app/home"
  },
  {
    "id": "constructor",
    "title": "Constructor (Concept)",
    "kicker": "Your Vision, Our Expertise",
    "short_description": "A concept for professional construction agency delivering precision and quality in every project",
    "description": "This construction agency website is designed to stand out and leave a strong impression on business clients and project stakeholders. The bold yellow accents and clean typography give it a confident and professional feel, while the well-organized layout makes it easy to find key information. It’s tailored for professionals in real estate, renovations, and large-scale projects, showcasing the agency’s expertise and reliability.",
    "media": [
      {
        "fullPath": "assets/images/constructor/logo.png",
        "altText": "Constructor logo"
      },
      {
        "fullPath": "assets/images/constructor/app.png",
        "altText": "Constructor image"
      }
    ],
    "github_link": "",
    "live_demo": ""
  },
  {
    "id": "smile",
    "title": "Smile (Concept)",
    "kicker": "Bringing Confidence to Every Smile",
    "short_description": "A concept for a dental care service delivering personalized and accessible care",
    "description": "Smile is a concept for a dental care website that feels approachable and easy to navigate. It’s designed for individuals and families looking for reliable dental care, with a focus on making services accessible and convenient. The calming blue tones and clean design help build trust, while the layout ensures a smooth and stress-free experience for users. This page highlights how modern design can make healthcare feel personal and welcoming.",
    "media": [
      {
        "fullPath": "assets/images/smile/logo.png",
        "altText": "Smile logo"
      },
      {
        "fullPath": "assets/images/smile/app.png",
        "altText": "Smile image"
      }
    ],
    "github_link": "",
    "live_demo": ""
  }
]
